seanyboy1/chatbot/firmware/t-display-p4/sdkconfig.defaults
# ── Target ─────────────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32p4"

# ── Chip revision (board has ESP32-P4 v1.0) ────────────────────────────────────
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# ── FreeRTOS ───────────────────────────────────────────────────────────────────
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# ── Flash ──────────────────────────────────────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ── Flash speed ────────────────────────────────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHFREQ_120M=y

# ── PSRAM — must match LILYGO T-Display P4 hardware (HEX mode, 200MHz) ─────────
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y

# ── Cache — required for HEX-mode PSRAM ────────────────────────────────────────
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# ── WiFi — disabled until C6 has compatible esp_hosted slave firmware ──────────
# The C6 factory firmware is incompatible with esp_hosted SDIO — causes SDIO storm.
# Flash C6 via PROG_C6 header with ~/esp_hosted_slave/build/network_adapter.bin,
# then add espressif/esp_hosted + esp_wifi_remote to main/idf_component.yml.

# ── Ethernet ───────────────────────────────────────────────────────────────────
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ETH_PHY_IP101=y
CONFIG_ETH_PHY_NEGOTIATION_TIMEOUT_MS=4000

# ── LCD RGB ────────────────────────────────────────────────────────────────────
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y

# ── LVGL 9 ─────────────────────────────────────────────────────────────────────
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_OBJ=y
CONFIG_LV_USE_ARC=y
CONFIG_LV_USE_BAR=y
CONFIG_LV_USE_LINE=y
CONFIG_LV_USE_ANIM=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# ── Screen pixel format ────────────────────────────────────────────────────────
CONFIG_SCREEN_PIXEL_FORMAT_RGB565=y

# ── Stack ──────────────────────────────────────────────────────────────────────
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ── Logging ────────────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# ── Watchdog — allow extra time for screenshot render on 568×1232 screen ───────
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# ── LVGL snapshot (screenshot) ─────────────────────────────────────────────────
CONFIG_LV_USE_SNAPSHOT=y

# ── FatFS / SDMMC — keep sector buffers in internal SRAM (IDMAC DMA requirement) ─
# PSRAM DMA causes CMD17 DRTO+FRUN on ESP32-P4 despite SOC_SDMMC_PSRAM_DMA_CAPABLE=1
CONFIG_FATFS_ALLOC_PREFER_EXTRAM=n
# Allocations < 1024 B always land in internal SRAM — FatFS win[] / sector buf
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
# SD cards use 512-byte sectors; fixed-size avoids 4 KB window in internal SRAM
CONFIG_FATFS_SECTOR_512=y
